
GetPassphraseDescription = "You need a passphrase to unlock the secret key for user: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "You need a passphrase to unlock the secret key for user: \"%@\", ID %@, (main key ID %@)";
PassphraseLabel = "Passphrase:";



//For Key-Status
"Invalid" = "Invalid";
"Revoked" = "Revoked";
"Expired" = "Expired";
"Disabled" = "Disabled";
"Unknown" = "Unknown";
"Marginal" = "Marginal";
"Full" = "Full";
"Ultimate" = "Ultimate";


//For Undo and Redo
Undo_NewKey = "New Key";
Undo_Delete = "Delete";
Undo_CleanKey = "Clean";
Undo_MinimizeKey = "Minimize";
Undo_RevokeKey = "Revoke Key";
Undo_ChangeExpirationDate = "Change Expiration Date";
Undo_ChangePassphrase = "Change Passphrase";
Undo_AlgorithmPreferences = "Change Algorithm Preferences";
Undo_Import = "Import";
Undo_AddSignature = "Add Signature";
Undo_RemoveSignature = "Remove Signature";
Undo_RevokeSignature = "Revoke Signature";
Undo_AddSubkey = "Add Subkey";
Undo_RemoveSubkey = "Remove Subkey";
Undo_RevokeSubkey = "Revoke Subkey";
Undo_AddUserID = "Add UserID";
Undo_RemoveUserID = "Remove UserID";
Undo_RevokeUserID = "Revoke UserID";
Undo_PrimaryUserID = "Primary UserID";
Undo_AddPhoto = "Add Photo";
Undo_RefreshFromServer = "Refresh from server";
Undo_ReceiveFromServer = "Receive from server";



//Algorithm names
CIPHER_ALGO_NONE = "None";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "None";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_EllipticCurveAlgorithm = "EllipticCurve";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
"Algorithm_%i" = "Algorithm_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Signed";
"Signature expired" = "Signature expired";
"Key expired" = "Key expired";
"Bad signature" = "Bad signature";
"Signature revoked" = "Signature revoked";
"Signature error" = "Signature error";
"Unverifiable signature" = "Unverifiable signature";
"Signed by stranger" = "Signed by stranger";
